Feature: 一起看的取捨

  Rule: 兩人的層級數與層內排序相同時，選一起看

    Example: 北方兩個場次觀眾都能看，但同伴只能看 11/17，所以兩人一起看 11/17
      Given 影展場次表如下：
        | 片名 | 日期       | 開演  | 片長 | 影廳  |
        | 北方 | 2026-11-15 | 19:00 | 100  | TITAN |
        | 北方 | 2026-11-17 | 19:00 | 100  | TITAN |
      And 觀眾的分層如下：
        | 片名 | 層級 |
        | 北方 | 想看 |
      And 同伴的分層如下：
        | 片名 | 層級 |
        | 北方 | 想看 |
      And 同伴已設定不可看時段如下：
        | 日期       | 時段       |
        | 2026-11-15 | 整天不可看 |
      When 觀眾執行排程
      Then 兩人行程依日期排列如下：
        | 日期       | 開演  | 片名 | 參與者 |
        | 2026-11-17 | 19:00 | 北方 | 一起   |

  Rule: 為了一起看會讓其中一人少看一部同層級或更高層級的片時，不一起看

    Example: 觀眾若跟同伴去看 11/15 的北方，就看不到必看的紅色沙漠，所以分開看
      Given 影展場次表如下：
        | 片名     | 日期       | 開演  | 片長 | 影廳              |
        | 紅色沙漠 | 2026-11-15 | 19:30 | 120  | 台北信義威秀 10廳 |
        | 北方     | 2026-11-15 | 19:00 | 100  | TITAN             |
        | 北方     | 2026-11-17 | 14:00 | 100  | 台北信義威秀 12廳 |
      And 觀眾的分層如下：
        | 片名     | 層級 |
        | 紅色沙漠 | 必看 |
        | 北方     | 想看 |
      And 同伴的分層如下：
        | 片名 | 層級 |
        | 北方 | 必看 |
      And 同伴已設定不可看時段如下：
        | 日期       | 時段       |
        | 2026-11-17 | 整天不可看 |
      When 觀眾執行排程
      Then 兩人行程依日期排列如下：
        | 日期       | 開演  | 片名     | 參與者   |
        | 2026-11-15 | 19:00 | 北方     | 同伴自己 |
        | 2026-11-15 | 19:30 | 紅色沙漠 | 觀眾自己 |
        | 2026-11-17 | 14:00 | 北方     | 觀眾自己 |

  Rule: 為了一起看而讓其中一人改看層內排序較後的片，也不一起看

    Example: 觀眾若為了跟同伴看小城之春，就得放掉排在前面的北方，所以分開看
      Given 影展場次表如下：
        | 片名     | 日期       | 開演  | 片長 | 影廳              |
        | 北方     | 2026-11-15 | 19:00 | 100  | 台北信義威秀 10廳 |
        | 小城之春 | 2026-11-15 | 19:30 | 90   | 台北信義威秀 11廳 |
      And 觀眾的分層如下：
        | 片名     | 層級 |
        | 北方     | 想看 |
        | 小城之春 | 想看 |
      And 同伴的分層如下：
        | 片名     | 層級 |
        | 小城之春 | 想看 |
      When 觀眾執行排程
      Then 兩人行程依日期排列如下：
        | 日期       | 開演  | 片名     | 參與者   |
        | 2026-11-15 | 19:00 | 北方     | 觀眾自己 |
        | 2026-11-15 | 19:30 | 小城之春 | 同伴自己 |
